---
kind: type
id: T:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions
source: html/15f4337d-738d-ec32-e7bc-4f2c569f4c59.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions

Represents an object containing options for creating a set of AlignmentStationLabel .

## Syntax (C#)
```csharp
public class AlignmentStationLabelSetOptions
```